spray/tutorial/aachenBomb/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active              true;

parcelTypeId        1;

coupled             true;

cellValueSourceCorrection    on;

constantProperties
{
    rhoMin          rhoMin [1 -3 0 0 0 ] 1.0e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4187;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    Tvap            Tvap [ 0 0 0 1 0 ] 273;
    Tbp             Tvap [ 0 0 0 1 0 ] 373;
    constantVolume  false;

}

particleForces
{
    gravity           off;
    virtualMass       off;
    pressureGradient  off;
}

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

DispersionModel     none;

DragModel           SphereDrag;

InjectionModel      none;

PatchInteractionModel StandardWallInteraction;

StandardWallInteractionCoeffs
{
    type            rebound;
}

HeatTransferModel RanzMarshall;

CompositionModel SinglePhaseMixture;

PhaseChangeModel LiquidEvaporation;

PostProcessingModel none;

radiation       off;

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

RanzMarshallCoeffs
{
    // thermal shielding
    BirdCorrection  true;
}

SinglePhaseMixtureCoeffs
{
    phases
    (
        liquid
        {
            C7H16 1;
        }
    );
}

LiquidEvaporationCoeffs
{
    enthalpyTransfer enthalpyDifference;

    activeLiquids
    (
        C7H16
    );
}


// ************************************************************************* //
